{
  "Strapi CMS": "Un sistema de gestión de contenido (CMS) de código abierto y flexible basado en Node.js.",
  "Vue3": "Una biblioteca de JavaScript para crear interfaces de usuario interactivas y componentes reutilizables.",
  "SCSS": "Un preprocesador de CSS que extiende las capacidades de CSS con características como variables y anidación.",
  "Docker": "Una plataforma para desarrollar, enviar y ejecutar aplicaciones en contenedores.",
  "Azure Devops": "Una suite de herramientas de colaboración y desarrollo de software de Microsoft.",
  "Net Core": "Un marco de desarrollo de código abierto desarrollado por Microsoft.",
  "Vue": "Una biblioteca de JavaScript para crear interfaces de usuario interactivas y componentes reutilizables.",
  "MongoDb": "Una base de datos NoSQL de alto rendimiento y orientada a documentos.",
  "MySql": "Un sistema de gestión de bases de datos relacional de código abierto.",
  "WebComponents": "Un conjunto de estándares de la web para crear componentes reutilizables en aplicaciones web.",
  "Node.js": "Un entorno de tiempo de ejecución de JavaScript basado en el motor V8 de Google Chrome.",
  "SOA": "Arquitectura orientada a servicios (Service-Oriented Architecture), un enfoque para el diseño de sistemas de software.",
  "REST": "Representational State Transfer, un estilo de arquitectura de software para sistemas distribuidos.",
  "Net 4.8": "Versión 4.8 de la plataforma .NET de Microsoft.",
  "Net Core": "Un marco de desarrollo de código abierto desarrollado por Microsoft.",
  "Quasar Framework": "Un framework para el desarrollo de aplicaciones web y móviles basado en Vue.js.",
  "Sql Server": "Un sistema de gestión de bases de datos relacional desarrollado por Microsoft.",
  "SqlServer": "Abreviatura común para Microsoft SQL Server, un sistema de gestión de bases de datos.",
  "T/SQL": "Transact-SQL, un lenguaje de programación para gestionar bases de datos SQL Server.",
  "DDD": "Diseño impulsado por el dominio (Domain-Driven Design), un enfoque de diseño de software.",
  "REST": "Representational State Transfer, un estilo de arquitectura de software para sistemas distribuidos.",
  "Azure Devops": "Una suite de herramientas de colaboración y desarrollo de software de Microsoft.",
  ".MVC5": "ASP.NET MVC 5, un marco de desarrollo para aplicaciones web de Microsoft.",
  "C#": "Un lenguaje de programación desarrollado por Microsoft.",
  "C ": "Un lenguaje de programación de alto nivel ampliamente utilizado.",
  "C\\+\\+": "C++, un lenguaje de programación de alto nivel que extiende C.",
  "TSQL": "Transact-SQL, un lenguaje de programación para gestionar bases de datos SQL Server.",
  "Cake": "CakePHP, un framework de desarrollo web para PHP.",
  "C/C\\+\\+": "Lenguajes de programación C y C++.",
  "BorlandC Builder": "Un entorno de desarrollo integrado (IDE) de Borland para C++.",
  "Linux": "Un sistema operativo de código abierto basado en Unix.",
  "TypeScript": "Un superconjunto de JavaScript que agrega tipos estáticos al lenguaje.",
  "Visual Basic": "Un lenguaje de programación desarrollado por Microsoft.",
  "XML": "Lenguaje de marcado extensible utilizado para almacenar y transportar datos.",
  "Python": "Un lenguaje de programación de alto nivel conocido por su simplicidad y legibilidad.",
  "CPP": "C++, un lenguaje de programación de alto nivel que extiende C.",
  "DirectX": "Una colección de APIs para desarrollo de aplicaciones multimedia y juegos en Windows.",
  "Win95": "Windows 95, un sistema operativo de Microsoft.",
  "CalderaOs": "Un sistema operativo de código abierto basado en Linux.",
  "SQL": "Structured Query Language, un lenguaje para gestionar bases de datos.",
  "XSL": "Extensible Stylesheet Language, un lenguaje de transformación XML.",
  "Api Rest": "Interfaz de programación de aplicaciones basada en REST para servicios web.",
  "API Rest": "Interfaz de programación de aplicaciones basada en REST para servicios web.",
  "Api Soap": "Interfaz de programación de aplicaciones basada en el Protocolo Simple de Acceso a Objeto (SOAP).",
  "Vanilla Javascript": "JavaScript puro sin bibliotecas o frameworks adicionales.",
  "JavaScript": "Un lenguaje de programación ampliamente utilizado en desarrollo web.",
  "Jquery": "Una biblioteca de JavaScript que simplifica la manipulación del DOM y la interacción con el cliente.",
  "Oracle DB": "Oracle Database, un sistema de gestión de bases de datos relacional de Oracle.",
  "GIT": "Un sistema de control de versiones distribuido ampliamente utilizado.",
  "FacturaE": "Un estándar para la facturación electrónica en Europa.",
  "Crystal Reports": "Una herramienta para la generación de informes y documentos.",
  "Angular2+": "Un framework de desarrollo de aplicaciones web basado en TypeScript.",
  "Node": "Node.js, un entorno de tiempo de ejecución de JavaScript basado en el motor V8 de Google Chrome.",
  "Mysql": "Un sistema de gestión de bases de datos relacional de código abierto.",
  "Java 1.8": "Java 1.8, una versión de la plataforma Java de Oracle.",
  "Mithril": "Un framework de desarrollo web para la creación de aplicaciones de una sola página (SPA).",
  "SPA": "Aplicación de una sola página, un tipo de aplicación web que carga una sola página y se actualiza dinámicamente.",
  "OpenLayers": "Una biblioteca de JavaScript para la visualización de mapas interactivos en aplicaciones web.",
  "Charts.js": "Una biblioteca de JavaScript para crear gráficos interactivos en aplicaciones web.",
  "API Soap": "Interfaz de programación de aplicaciones basada en el Protocolo Simple de Acceso a Objeto (SOAP).",
  "NancyFx": "Un framework de desarrollo web ligero para aplicaciones web basadas en .NET.",
  ".Net WebApi": "ASP.NET Web API, un marco de desarrollo para crear servicios web en .NET.",
  "EntityFramework": "Un ORM (Object-Relational Mapping) de .NET para acceder a bases de datos relacionales.",
  "Bash": "Un intérprete de comandos y lenguaje de script para sistemas Unix y Unix-like.",
  "UC4": "Un sistema de automatización de procesos empresariales y flujo de trabajo.",
  "MVC.NET": "Model-View-Controller para aplicaciones web en el entorno .NET.",
  "PL/SQL": "Procedural Language/Structured Query Language, un lenguaje de programación para bases de datos Oracle.",
  "Java": "Un lenguaje de programación de alto nivel ampliamente utilizado.",
  "FatWire Content Managent System 5.2": "Un sistema de gestión de contenido web de Oracle.",
  "MVNForum": "Un sistema de foros basado en Java y Maven.",
  "Html": "HyperText Markup Language, un lenguaje de marcado para la creación de páginas web.",
  "CSS": "Cascading Style Sheets, un lenguaje de diseño para la presentación de páginas web.",
  "Javascript": "Un lenguaje de programación ampliamente utilizado en desarrollo web.",
  "JQuery": "Una biblioteca de JavaScript que simplifica la manipulación del DOM y la interacción con el cliente.",
  "Sql": "Structured Query Language, un lenguaje para gestionar bases de datos.",
  "Php": "Hypertext Preprocessor, un lenguaje de programación ampliamente utilizado en desarrollo web.",
  "PHP": "Hypertext Preprocessor, un lenguaje de programación ampliamente utilizado en desarrollo web.",
  ".Net": "Un framework de desarrollo de software de Microsoft.",
  "Groovy": "Un lenguaje de programación dinámico que se ejecuta en la Máquina Virtual de Java (JVM).",
  "Bash": "Un intérprete de comandos y lenguaje de script para sistemas Unix y Unix-like.",
  "Visual Basic for Applications": "Un lenguaje de programación de scripting utilizado en aplicaciones de Microsoft Office y otras.",
  "Fatwire Content Management System": "Un sistema de gestión de contenido web de Oracle.",
  "OpenMarket CMS": "Un sistema de gestión de contenido web.",
  "Gradle": "Una herramienta de automatización de compilación utilizada en el desarrollo de software.",
  "Maven": "Una herramienta de administración de proyectos utilizada en el desarrollo de software.",
  "Ant": "Una herramienta de construcción de proyectos de software basada en XML.",
  "Make": "Una herramienta de construcción de proyectos ampliamente utilizada en sistemas Unix y Unix-like.",
  "Webpack": "Un empaquetador de módulos para aplicaciones web.",
  "Bash": "Un intérprete de comandos y lenguaje de script para sistemas Unix y Unix-like.",
  "PowerShell": "Un lenguaje de scripting y shell desarrollado por Microsoft para la administración de sistemas.",
  "Gulp.js": "Un sistema de construcción de flujos de trabajo y automatización de tareas en JavaScript.",
  "Quartz": "Un marco de programación de tareas y cronogramas en Java.",
  "SOAP UI": "Una herramienta de prueba funcional y de carga para servicios web basados en SOAP.",
  "Insomnia": "Una herramienta de prueba y depuración de API y servicios web.",
  "Curl": "Una herramienta de línea de comandos para transferencia de datos con URL.",
  "Oracle Virtual Box": "Una aplicación de virtualización de código abierto para crear máquinas virtuales.",
  "Kubernetes": "Un sistema de orquestación de contenedores para la gestión de aplicaciones en contenedores.",
  "Apache": "Un servidor web de código abierto ampliamente utilizado.",
  "WebLogic": "Oracle WebLogic Server, un servidor de aplicaciones Java EE.",
  "WebSphere": "IBM WebSphere Application Server, un servidor de aplicaciones Java EE.",
  "IIS7/8.5": "Internet Information Services, el servidor web de Microsoft en las versiones 7 y 8.5.",
  "Oracle Aplication Server": "Un servidor de aplicaciones de Oracle.",
  "Tomcat": "Apache Tomcat, un contenedor web y servidor de aplicaciones Java de código abierto.",
  "Sellenium": "Selenium, un conjunto de herramientas para la automatización de pruebas de software.",
  "Geb": "Un marco de prueba funcional para aplicaciones web basadas en Groovy.",
  "SikuliX": "Una herramienta de automatización de pruebas que utiliza la visión por computadora.",
  "Robotframework": "Un marco de automatización de pruebas de código abierto.",
  "HTML": "HyperText Markup Language, un lenguaje de marcado para la creación de páginas web.",
  "Git": "Un sistema de control de versiones distribuido ampliamente utilizado.",
  "Subversion": "Un sistema de control de versiones centralizado.",
  "Jmeter": "Apache JMeter, una herramienta de prueba de carga y desempeño.",
  "Visual Studio Code": "Un entorno de desarrollo de código abierto de Microsoft.",
  "Visual Studio": "Un entorno de desarrollo integrado (IDE) de Microsoft.",
  "Eclipse": "Un entorno de desarrollo integrado (IDE) de código abierto.",
  "Sublime Text": "Un editor de texto avanzado para programadores.",
  "Vim/Nano": "Vim y Nano, editores de texto de línea de comandos.",
  "JetBrains": "Una empresa que desarrolla herramientas de desarrollo de software, como IntelliJ IDEA.",
  "WinApi": "Interfaz de programación de aplicaciones de Windows, que permite a las aplicaciones interactuar con el sistema operativo Windows."
}
